In [1]:
import pandas as pd
import numpy as np

In [2]:
s=np.arange(1,21).reshape(5,4)
s

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16],
       [17, 18, 19, 20]])

In [3]:
df=pd.DataFrame(s,index=['R1','R2','R3','R4','R5'],columns=['C1','C2','C3','C4'])
df

    C1  C2  C3  C4
R1   1   2   3   4
R2   5   6   7   8
R3   9  10  11  12
R4  13  14  15  16
R5  17  18  19  20

In [4]:
df.set_axis([1,2,3,4],axis=1)

     1   2   3   4
R1   1   2   3   4
R2   5   6   7   8
R3   9  10  11  12
R4  13  14  15  16
R5  17  18  19  20

In [5]:
df.set_axis([1,2,3,4],axis='columns')

     1   2   3   4
R1   1   2   3   4
R2   5   6   7   8
R3   9  10  11  12
R4  13  14  15  16
R5  17  18  19  20

In [7]:
df.set_axis([1,2,3,4,5],axis=0)

   C1  C2  C3  C4
1   1   2   3   4
2   5   6   7   8
3   9  10  11  12
4  13  14  15  16
5  17  18  19  20

In [8]:
df.set_axis([1,2,3,4,5],axis='index')

   C1  C2  C3  C4
1   1   2   3   4
2   5   6   7   8
3   9  10  11  12
4  13  14  15  16
5  17  18  19  20

In [9]:
df

    C1  C2  C3  C4
R1   1   2   3   4
R2   5   6   7   8
R3   9  10  11  12
R4  13  14  15  16
R5  17  18  19  20

In [11]:
df.set_index('C1')

    C2  C3  C4
C1
1    2   3   4
5    6   7   8
9   10  11  12
13  14  15  16
17  18  19  20

In [12]:
df

    C1  C2  C3  C4
R1   1   2   3   4
R2   5   6   7   8
R3   9  10  11  12
R4  13  14  15  16
R5  17  18  19  20

In [13]:
df.set_index(['C1','C3'])

       C2  C4
C1 C3
1  3    2   4
5  7    6   8
9  11  10  12
13 15  14  16
17 19  18  20

In [14]:
df

    C1  C2  C3  C4
R1   1   2   3   4
R2   5   6   7   8
R3   9  10  11  12
R4  13  14  15  16
R5  17  18  19  20

In [15]:
df.take([0,2])

    C1  C2  C3  C4
R1   1   2   3   4
R3   9  10  11  12

In [16]:
df.take([0,2,1])

    C1  C2  C3  C4
R1   1   2   3   4
R3   9  10  11  12
R2   5   6   7   8

In [17]:
df.take([0,2,1],axis=1)

    C1  C3  C2
R1   1   3   2
R2   5   7   6
R3   9  11  10
R4  13  15  14
R5  17  19  18

In [18]:
#(before=2, after=4)
df

    C1  C2  C3  C4
R1   1   2   3   4
R2   5   6   7   8
R3   9  10  11  12
R4  13  14  15  16
R5  17  18  19  20

In [19]:
df.truncate(before='R2',after='R4')

    C1  C2  C3  C4
R2   5   6   7   8
R3   9  10  11  12
R4  13  14  15  16

In [21]:
df.truncate(before='C2',after='C4',axis=1)

    C2  C3  C4
R1   2   3   4
R2   6   7   8
R3  10  11  12
R4  14  15  16
R5  18  19  20

In [22]:
s = pd.Series([1, None, None, 2])

s

0    1.0
1    NaN
2    NaN
3    2.0
dtype: float64

In [23]:
s.bfill()

0    1.0
1    2.0
2    2.0
3    2.0
dtype: float64

In [24]:
s

0    1.0
1    NaN
2    NaN
3    2.0
dtype: float64

In [25]:
s.dropna()

0    1.0
3    2.0
dtype: float64

In [26]:
s

0    1.0
1    NaN
2    NaN
3    2.0
dtype: float64

In [27]:
s.bfill()

0    1.0
1    2.0
2    2.0
3    2.0
dtype: float64

In [28]:
s.ffill()

0    1.0
1    1.0
2    1.0
3    2.0
dtype: float64

In [29]:
s

0    1.0
1    NaN
2    NaN
3    2.0
dtype: float64

In [30]:
s.fillna(100)

0      1.0
1    100.0
2    100.0
3      2.0
dtype: float64